# Normalizing Genres

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
from sqlalchemy.types import *
import json
with open('/Users/dmusl/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()
db_name = "movies"
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

In [2]:
titles = pd.read_csv("Data/title_basics.csv", low_memory=False)
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

In [3]:
titles.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

## Get a list of Unique Genres

In [4]:
## create a col with a list of genres
titles['genres_split'] = titles['genres'].str.split(',')
titles

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
86974,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
86975,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86976,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [5]:
# Separate genres into new rows
exploded_genres = titles.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
86978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
86978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [6]:
# get and save list of unique genres
genres_split = titles['genres'].str.split(",")
unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Biography', 'Mystery', 'Musical', 'Action', 'Adventure', 'Crime',
       'Thriller', 'Music', 'Animation', 'Family', 'History', 'War',
       'Sport', 'Western', 'Adult', 'Reality-TV', 'News', 'Talk-Show',
       'Game-Show'], dtype=object)

In [7]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

## Create a new title_genres table

In [8]:
# Save tconst and genres_split as new df
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## Create a genre mapper dictionary to replace string genres with integers

In [9]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

## Replace the string genres in title_genres with the new integer ids.

In [10]:
title_genres['genres_split'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.rename(columns={'genres_split':'genre_id'})
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

## Convert the genre map dictionary into a dataframe

In [11]:
# Manually make the dataframe with the named columns from the .keys and .values
genre_lookup = pd.DataFrame({'genre_name' : genre_map.keys(),
                             'genre_id' :genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Creating MySQL tables with a primary key using Python

In [12]:
genre_lookup.dtypes

genre_name    object
genre_id       int64
dtype: object

In [13]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [14]:
# Create a schema dictionary using SQLAlchemy datatype objects
genretypes_dict = {'genre_id': INTEGER(),
               'genre_name': VARCHAR(45),
                  'tconst' : VARCHAR(12) }
genretypes_dict

{'genre_id': INTEGER(),
 'genre_name': VARCHAR(length=45),
 'tconst': VARCHAR(length=12)}

In [17]:
title_genres.to_sql("title_genres",conn,index=False, if_exists='append')

162600

In [18]:
# Save to sql with dtype and index=False
genre_lookup.to_sql("genres",conn,index=False, if_exists='append')

25

In [34]:
# describe
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, conn)

In [21]:
# confirming data has been added
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q,conn)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [22]:
# describe
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, conn)

,Field,Type,Null,Key,Default,Extra
0,genre_id,int,NO,PRI,None,auto_increment
1,genre_name,varchar(45),YES,,None,
2,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [23]:
# confirming data has been added
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q,conn)

   genre_id genre_name          created_at          updated_at
0         1      Adult 2023-11-09 12:00:14 2023-11-09 12:00:14
1         2  Adventure 2023-11-09 12:00:14 2023-11-09 12:00:14
2         3  Animation 2023-11-09 12:00:14 2023-11-09 12:00:14
3         4  Biography 2023-11-09 12:00:14 2023-11-09 12:00:14
4         5     Comedy 2023-11-09 12:00:14 2023-11-09 12:00:14

# Create TMDB Table

In [24]:
df = pd.read_csv('Data/tmdb_years.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2653 entries, 0 to 2652
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2653 non-null   object
 1   adult                  2651 non-null   float64
 2   backdrop_path          1522 non-null   object
 3   belongs_to_collection  217 non-null    object
 4   budget                 2651 non-null   float64
 5   genres                 2651 non-null   object
 6   homepage               213 non-null    object
 7   id                     2651 non-null   float64
 8   original_language      2651 non-null   object
 9   original_title         2651 non-null   object
 10  overview               2592 non-null   object
 11  popularity             2651 non-null   float64
 12  poster_path            2410 non-null   object
 13  production_companies   2651 non-null   object
 14  production_countries   2651 non-null   object
 15  release_date           2628 non-null   object
 16  revenue                2651 non-null   float64
 17  runtime                2651 non-null   float64
 18  spoken_languages       2651 non-null   object
 19  status                 2651 non-null   object
 20  tagline                1153 non-null   object
 21  title                  2651 non-null   object
 22  video                  2651 non-null   float64
 23  vote_average           2651 non-null   float64
 24  vote_count             2651 non-null   float64
 25  certification          869 non-null    object
dtypes: float64(9), object(17)
memory usage: 539.0+ KB

In [26]:
t_tmdb = df.drop(columns=['adult',
                               'backdrop_path',
                               'belongs_to_collection',
                               'genres',
                               'homepage',
                               'id',
                               'original_language',
                               'original_title', 
                               'overview', 
                               'popularity',
                               'poster_path',
                               'production_companies',
                               'production_countries', 
                               'release_date',
                               'runtime',
                               'spoken_languages',
                               'status', 
                               'tagline',
                               'title', 
                               'video',
                               'vote_average',
                               'vote_count'])

t_tmdb.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0035423  48000000.0  76019048.0         PG-13
2  tt0114447         0.0         0.0           NaN
3  tt0116916         0.0         0.0            PG
4  tt0118589  22000000.0   5271666.0         PG-13

In [27]:
# Calculate max string lenghts for object columns
imdb_id_length = df['imdb_id'].fillna('').map(len).max()
imdb_id_length

10

In [28]:
# Calculate max string lenghts for object columns
certification_length = df['certification'].fillna('').map(len).max()
certification_length

5

In [30]:
# Create a schema dictionary using SQLAlchemy datatype objects
dtypes_dict = {'imdb_id': VARCHAR(12),
               'certification': VARCHAR(6), 
               'revenue': FLOAT(),
               'budget': FLOAT()}
dtypes_dict

{'imdb_id': VARCHAR(length=12),
 'certification': VARCHAR(length=6),
 'revenue': FLOAT(),
 'budget': FLOAT()}

In [31]:
# save to sql with dtypes and index = False
t_tmdb.to_sql('tmdb_data', conn, dtype = dtypes_dict, if_exists = 'replace', index = False)

2653

In [33]:
q = '''DESCRIBE tmdb_data'''
pd.read_sql(q, conn)

           Field         Type Null Key Default Extra
0        imdb_id  varchar(12)  YES        None
1         budget        float  YES        None
2        revenue        float  YES        None
3  certification   varchar(6)  YES        None

In [35]:
# confirm the data has been added
q = """SELECT * FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q,conn)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0035423  48000000.0  76019000.0         PG-13
2  tt0114447         0.0         0.0          None
3  tt0116916         0.0         0.0            PG
4  tt0118589  22000000.0   5271670.0         PG-13

# Show Tables

In [36]:
# SHOW TABLES 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [37]:
# confirming data has been added
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q,conn)

   genre_id genre_name          created_at          updated_at
0         1      Adult 2023-11-09 12:00:14 2023-11-09 12:00:14
1         2  Adventure 2023-11-09 12:00:14 2023-11-09 12:00:14
2         3  Animation 2023-11-09 12:00:14 2023-11-09 12:00:14
3         4  Biography 2023-11-09 12:00:14 2023-11-09 12:00:14
4         5     Comedy 2023-11-09 12:00:14 2023-11-09 12:00:14

In [40]:
# confirming data has been added
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q,conn)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [41]:
# confirming data has been added
q = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q,conn)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0035423  48000000.0  76019000.0         PG-13
2  tt0114447         0.0         0.0          None
3  tt0116916         0.0         0.0            PG
4  tt0118589  22000000.0   5271670.0         PG-13